app/controllers/talks_controller.rb

SELECT "TALKS".* FROM "TALKS"
---
  def index
    @talks = Talk.all

INSERT INTO "TALKS" ("CONTENT", "CREATED_AT", "ID", "IP_ADDRESS", "NICKNAME", "OWNER_ID", "UPDATED_AT", "WRITED_DATE", "WRITER_ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7, :a8, :a9)
---
  def create
    @talk = Talk.new(talk_params)

    respond_to do |format|
      if @talk.save

SELECT * FROM (SELECT  "TALKS".* FROM "TALKS"  WHERE "TALKS"."OWNER_ID" = 'sf001'  ORDER BY id desc) WHERE ROWNUM <= 30
---
  def list
    @talks = Talk.where(owner_id: params[:owner_id]).order("id desc").limit(params[:size])

INSERT INTO "TALKS" ("CONTENT", "CREATED_AT", "ID", "NICKNAME", "UPDATED_AT") VALUES (:a1, :a2, :a3, :a4, :a5)  [["content", "컨텐츠 테스트1"], ["created_at", 2014-07-22 12:32:10 UTC], ["id", 10022], ["nickname", "닉네임 테스트1"], ["updated_at", 2014-07-22 12:32:10 UTC]]
---
  def create_talk
    @talk = Talk.new(params.require(:talk).permit(:nickname, :content))
    @talk.writed_date = DateTime.now
    @talk.owner_id = params[:owner_id]

    respond_to do |format|
      if @talk.save

SELECT  "TALKS".* FROM "TALKS"  WHERE "TALKS"."ID" = :a1 AND ROWNUM <= 1  [["id", 10000]]
---
    def set_talk
      @talk = Talk.find(params[:id])